
[Language]
DisplayName= 简体中文

[600]

0=TAB名称
1=日志
2=村庄
3=攻击计划
4=Bot
5=关于我们
6=杂项
7=部落城堡
8=升级
9=奖杯
10=通知
11=援兵设置
12=捐兵设置
13=捐兵时段
14=实验室
15=英雄
16=建筑
17=城墙
18=PushBullet
19=说明
20=部队
21=法术
22=加速
23=死鱼
24=活鱼
25=偷本
26=弱本
27=选项
28=搜索
29=攻击
30=结束战斗
31=死鱼判定
32=奖杯设置
33=加载配置
34=保存配置
35=选项
36=简介
37=统计
38=收益
39=综合
40=攻击
41=训练军队
42=搜索&攻击
43=策略
49=注：该策略被禁用，打勾以启用
50=打勾来启用它！
51=调试
44=A-建筑物
45=B-进攻条件
46=C-攻击
47=D-挤压攻击后
48=其它



[601]

1=
2=主机器人日志
3=日志方式
4=使用设定的日志方式
5=使用分割方式显示日志
6=机器人日志和收益日志一样大小
7=大机器人日志, 小的收益日志
8=小机器人日志, 大的收益日志
9=全部机器人日志, 隐藏收益日志
10=隐藏机器人日志, 全部收益日志
11=清除收益日志
12=点击以清除收益日志
13=复制到剪贴板
14=使用此收益日志复制到剪贴板（CTRL+ C）
15=收益日志
16=                -----收 益-----                      ------奖 励-----                    
17=| 时 间 | 奖 杯 | 搜索次数 | 金 | 水 | 黑水 | 奖杯 | 星 | 金 | 水 | 黑水 | 升级 |
18=Paypal 捐赠？
19=支持发展



[602]
0=- 免费软件 MyBot
1=开始
2=停止
3=暂停
4=停止机器人的所有操作
5=恢复
6=用它来恢复已暂停的机器人
7=搜索模式
8=检测是否攻击. 搜索满足条件的村庄
9=截图
10=点击这里给你的村庄的一个快照，并将其保存到文件中
11=隐藏
12=让模拟器窗口隐藏在你的视窗上
13=(不是最小化，而是隐藏)
14=背景
15=模式
16=勾选后启用的后台模式 Bot
17=使用它来让你的模拟器视图隐藏在你的窗口上
18=攻击死鱼！
19=攻击活鱼！
20=偷本！
21=
22=村庄报表
23=第一次运行
24=将显示在这里
25=显示
26=显示

[603]
0=不使用
1=不使用
2=这个按钮将清除整行复选框
3=AM
4=PM
5=次，搜索
6=秒
7=秒
8=秒
9=
10=
11=
12=%
13=-
14=小时
15=小时
16=Su
17=星期日
18=Mo
19=星期一
20=Tu
21=星期二
22=We
23=星期三 
24=Th
25=星期四
26=Fr
27=星期五
28=Sa
29=星期六
30=只有在下列勾选时段捐兵
31=选择每周的哪几天
32=村庄






[604]

1=野蛮人
2=弓箭手
3=巨人
4=哥布林
5=炸弹人
6=炸弹人
7=气球
8=法师
9=天使
10=飞龙
11=皮卡超人
12=皮卡超人
13=亡灵
14=野猪骑士
15=女武神
16=石头人
17=女巫
18=熔岩猎犬
19=巨石投手
20=飞龙宝宝
21=掘地矿工




[605]

1=雷电
2=治疗
3=狂暴
4=弹跳
5=冰冻
6=毒药
7=地震
8=急速
9=毒药
10=地震
11=急速
12=镜像
13=骷髅


[606]

1=结束战斗
2=战斗中如果没有资源增加
3=在设定的时间内战利品没有额外的增加。
4=当王和所有部队释放完毕后开始倒数计时。
5=在
6=
7=当资源低于
8=如果金币低于这个数值，结束战斗。
9=当资源已经被打完。
10=当全部资源=0时，结束战斗。
11=当获得一星时，赢得游戏
12=在战斗中，如果获得一星就结束战斗。
13=当获得二星时，赢得游戏
14=在战斗中，如果获得二星就结束战斗。
15=攻击活鱼的特殊选项
16=攻击有黑水罐的一边，结束战斗选项
17=打活鱼时偷黑
18=当低于
19=当启用以下为黑水矿攻击的特殊条件
20=如果没有增加过滤条件去筛选那么当低于总黑水百分比时结束战斗。
21=禁止以普通方式结束战斗
22=当黑水方向进攻被启动后，禁止正常方式结束战斗选项
23=当得到一星时，且黑水低于最少值时结束战斗。
24=当
25=当黑水低于最低值，且蛮王残血时，结束战斗。
26=当残血时
27=当黑水低于最低值，且女王残血时，结束战斗。


[607]

1=配置
2=IMG
3=Make IMG with extra info in Profile -> Temp Folder
4=选择脚本，你可以在"CSV/攻击文件夹中编辑/添加新的攻击脚本
5=重新载入脚本文件
6=显示/编辑当前攻击脚本
7=创建新的攻击脚本
8=复制当前攻击脚本到一个新的脚本文件



[608]

1=配置
2=下兵指令
3=攻击方向
4=从一边进攻，可以穿透大本
5=从两个方向进攻，可以穿透大本
6=从三个方向进攻，达到外围，有时候可以打到大本
7=设定进攻方向数。
8=从一边进攻
9=从两边进攻
10=从三边进攻
11=均分到每个方向
12=延迟设置
13=这是军队进攻延迟设置，1（最快）相当于机器人，10（最慢），相当于人。
14=随机设定，让机器人更接近人
15=波数
16=随机延迟和进攻波数
17=使用智能攻击：红线附近
18=使用智能攻击贴近红线下兵
19=下兵方式
20=设定军队波数配置
21=方式1：在每一边下一种兵种，一波后，再转换成其他的兵种
22=方式2：在每一边下一个兵种(比如:哥布林,弓箭手,野蛮人)的全部兵力后再转下另一兵种
23=下一边, 然后换军队
24=下完部队, 然后换边
25=下一边, 然后换军队
26=在金矿附近下兵
27=在圣水收集集器附近下兵
28=在黑水采集器附近下兵
29=在一个接近黑水罐的方向进攻
30=在一个接近大本的方向进攻
31=金水方向进攻
32=大本方向进攻
33=Select a preset troop drop order.
34=Each option deploys troops in a different order and in different waves
35=Only the troops selected in the "Only drop these troops" option will be dropped


[609]

1=杯段设置
2=奖杯范围
3=最小: 机器人将会降杯到这个值
4=最大: 机器人将会降杯如果你的奖杯数大于这个值
5 =使用英雄降杯
6 =使用英雄降杯，如果英雄可用
7 =降杯时攻打死鱼
8 =降杯的同时攻击死鱼
9 =当军队
10=开始降杯之前，请输入攻击死鱼所需的部队占最大军队数的百分比

[610]

1 =暂停攻击
2 =使用这些选项来设置时，机器人就会停止攻击。
3 =暂停攻击
4 =停止Bot
5 =关闭Bot
6 =关闭CoC+Bot
7 =关闭PC
8 =睡眠PC
9 =重新启动PC
10 =当...
11 =金和水已满 且 达最大奖杯数
12 =金和水已满 或 达最大奖杯数
13 =金或水已满 且 达最大奖杯数
14 =金或水已满 或 达最大奖杯数
15 =金币和圣水 已满
16 =金币或圣水 已满
17 =金币已满 且 达最大奖杯数
18 =圣水已满 且 达最大奖杯数
19 =金币已满 或 达最大奖杯数
20 =圣水已满 或 达最大奖杯数
21 =金币 已满
22 =圣水 已满
23 =达最大奖杯数
24 =黑水 已满
25 =金币/圣水/黑水 全部已满
26 =Bot保持运行
27 =现在（只训练/捐兵）
28 =现在（只捐兵）
29 =现在（仅保持在线）
30 =有护盾时（只训练/捐兵）
31 =有护盾时（只捐兵）
32 =有护盾时（仅保持在线）
35 =当你耗尽资源时机器人会停止运行。当资源达设定的最小值时，BOT会重新启动。
36 =恢复攻击
37 =机器人最小金币恢复值，当低于最小金币值后停止进攻。
38 =机器人最小圣水恢复值，当低于最小圣水值后停止进攻。
39 =最小黑水恢复值，当低于最小黑水值后停止进攻。
40 =重置陷阱、收集资源车、清除障碍物
41 =重置所有陷阱、X弩和地狱之塔
42 =选中此选项自动重新武装陷阱，补充X弩和的地狱塔（如果有的话）的村庄。
43 =收集资源&战利品车
44 =选中此选项自动收集村庄里的资源
45 =收集金矿、圣水收集器、暗黑钻油井
46 =这也将搜索您村庄里的战利品车并收集
47 =清除墓碑
48 =选中此选项以在敌人进攻后清理墓碑
49 =清除障碍物
50 =检查树木，树干，并自动清理
51 =收集宝箱
52 =选中此选项自动收集宝箱
53 =手动定位
54 =大本营
55 =重新定位
56 =部落城堡
57 =箭塔
58 =兵营
59 =酒吧。
60 =军营
61 = S.F。
62 =法术工厂
63 = D.S.F。
64 =暗黑法术工厂
65 =野蛮人之王
66 =野蛮人之王圣坛
67 =弓箭女皇
68 =弓箭女皇圣坛
69 =大守护者
70 =大守护者圣坛
71 =实验室
72 =实验室
73 =重置。
74 =当你改变了你的村庄布局
75 =点击这里重置所有建筑物的位置

[611]

1 =部落城堡
2 =请求部队/法术
3 =什么都可以
4 =使用该本文在你的部落聊天室内请求增援
[612]
23 =黑名单
24 =自定义部队
27 =捐
28 =选中此捐赠
29 =捐赠给所有请求
31 =这也将忽略所有关键字
33 =不捐赠如果有这些关键字
34 =捐兵黑名单
81 =如果关键字与请求相匹配
82 =为所有请求捐赠
22 =捐赠菜单
25 =按拉丁字母
26 =勾选这个激活按字母捐兵
35 =野蛮人\r\n黄毛
36 =不要野蛮人\r\n不要黄毛
37 =弓箭手\r\n妹子\r\nMM
38 =不要弓箭手\r\n不要MM\r\n不要妹子
39 =巨人\r\n胖子\r\n黑胖
40 =不要胖子\r\n不要巨人\r\n不要黑胖
41 =哥布林\r\ngiants
42 =不要哥布林\r\nno goblins
43 =炸弹人\r\nwall breakers
44 =不要炸弹人\r\nno wall breakers
45 =气球\r\n球\r\n黑球
46 =不要气球\r\n不要黑球
47 =法师\r\nballoon
48 =不要法师\r\nno balloons
49 =天使
50 =不要天使
51 =龙\r\n飞龙
52 =不要龙\r\n不要飞龙
53 = 皮卡超人
54 =不要皮卡超人
55 =亡灵\r\n苍蝇
56 =不要亡灵\r\n不要苍蝇
57 =野猪\r\n野猪骑士
58 =不要野猪\r\n不要野猪骑士
59 =女武神\r\n女武
60 =不要女武神\r\n不要女武
61 =戈仑石人\r\n石头人
62 =不要戈仑石人\r\n不要石头人
63 =女巫
64 =不要女巫
65 =熔岩猎犬\r\n狗
66 =不要熔岩猎犬\r\n不要狗
87 =毒药
88 =不要毒药
89 =地震
90 =不要地震
91 =急速
92 =不要急速
71 =任何\r\n随意\r\n随便\r\n一切
72 =1.
73 =2.
74 =3.
76=只要
78 =黑名单
77 =有这些关键词时不捐兵
79 =部落战\r\n战
80 =普通黑水兵请求
32=捐赠关键字
76=只要\r\n仅要

[613]

1 =定时增援设置


[614]
1 =实验室
2 =实验室自动升级
3 =勾选以启用实验室自动升级
4 =下一项
5 =通过下拉菜单去设置军队的自动升级
6 =该部队的图标将出现在左侧
7 =黑水将优先用于升级法术和兵种而不是英雄！
8 =红色按钮意味着实验室升级正在进行
9 =当升级即将完成时将自动消失
10 =如果升级在正常结束之前的被使用宝石手动完成，
11 =请在开始新升级前点击红色按钮重设内部升级计时器
12 =警告 - 不必要的复位将强制重新检查实验室状态


[615]

1 =连续升级英雄设置
2 =勾选您要连续升级的英雄：
3 =当你有足够的黑水，激活你的蛮王的自动升级 (保留最小的黑水值)
4 =你可以在 综合 设置标签内定位你的蛮王的圣台位置
5 =恢复机器人需要对比你的 黑药的值 （在综合标签与这里保留最小黑水值）!
6 =当你有足够的黑水时激活女王自动升级 (保留最小的黑水值)
7 =你可以在 综合 标签内定位你的女王圣台位置
8 =当你有足够的黑水时，自动升级大守护者（请检查保留的黑水的最小值）
9 =您可以手动定位上标签您的大守护者圣坛
10=重启机器人时对比你的黑水值（这里的最小值和综合标签内的）
11=当大本营达7级后才能启用
12=当大本营达9级后才能启用
13=当大本营达11级后才能启用

[616]

27 =勾选启用升级
28 =定位升级后
29 =这显示升级的类型，请单击显示的位置
30 =状态: 红色=不可编辑, 黄色=可以编辑,没有完成, 绿色=完成
31 =这里的单位名称将在升级项目被检查后同步
32 =这里的单位等级将在升级项目被检查后同步
33 =这里的单位花费将在升级项目被检查后同步
34 =这里的单位升级时间将在升级项目被检查后同步
35 =选中连续升级
1 =建筑物或英雄
2 =单位名称
3 =等级
4 =类型
5 =成本
6 =时间
7 =重复
8 =这里显示升级方式
9 =定位升级物
10 =选中升级建筑物/英雄，再按下按钮来定位和记录
11 =升级重置
12 =按下按钮重置 & 移除全部的升级物定位信息
13 =如果重复框被选中，数据不会被重置
14 =最小.金币
15 =升级完成后保存这么多量的金币
16 =设定需要保留的金币值用于搜索 或者城墙升级
17 =最小圣水
18 =升级完成后保留这么多；量的圣水
19 =设定需要保留的圣水值用于造军队或者 城墙升级
20 =最小黑水
21 =当升级完成保留这么多量的黑水值
22 =设定的值要高于你造军队战斗需要的值
26 =圣水最小值

[617]

1 =自动升级城墙设置
2 =自动升级城墙
3 =检查这一点，如果有足够的资源来升级城墙
4 =设定搜寻灵敏值来测试和搜寻城墙。越高越好，但速度会更慢
5 =测试
6 =点击这里测试升级城墙
7 =使用金币升墙
8 =只用金币升级
9 =全部可用的城墙等级
10 =使用圣水升墙
11 =只能使用圣水的城墙
12 =只有城墙能用圣水升级时才可使用
13 =先使用圣水升级，才用金币升级
14 =先尝试使用圣水升级。如果没有足够的圣水才尝试使用金币升级城墙
15 =保留一个工人升级城墙
16 =选中此选项会强制保留一个工人来升级城墙并
17 =避免此工人被用来升级建筑物或英雄
18 =城墙等级
19 =只搜寻这个级别的城墙，并升级
20 =下一级升级的费用
21 =使用这个值作为一个指标
22 =如果你选择别的等级的墙，这个值将会更新
23 =保留的最小金币值
24 =保存这么多的金币在城墙升级完毕后
25 =设定的这个金币值用于其他建筑物升级或者搜索
27 =保留的最小圣水值
28 =设定这个值用于其他建筑物升级或者制造军队
29 =城墙等级
30 =搜寻到的城墙等级
31 =有
32=保留的圣水最小值


[618]

1 =守卫时间刷钱
2 =启用守卫时间刷钱模式
3 =在守卫时间内，启用守卫刷钱模式
4 =等待时间
5 =设定关闭COC，并成功等待获得护盾的时间 (1-99分钟)
6 =分钟
7 =刷钱 最小
8 =保留 最小
9 =当金币低于设定值时，放弃防御打钱，转换成正常打钱模式
10 =设定你搜寻或者升级所需要的钱的数量
11 =需要金币存储的数量时启动防御打钱
12 =输入你需要去攻击敌军或者升级的金币数量
13 =如果圣水低于设定的值时，放弃防御打钱，转换成正常打钱模式
14 =设定你需要训练军队或者是升级所需要的生水值
15 =圣水达到要求值时启用防御打钱
16 =输入你需要攻击敌军或者升级时需要的圣水
17 =如果黑水数值低于设定值停止防御打钱, 转换成正常打钱
18 =设定你需要训练军队或者升级所需要的黑水
19 =如果黑水的数值满足需求，则启用防御打钱
20 =输入你需要进攻敌军或者升级所需要的黑水
21 =使用固若金汤模式
22 =坚不可摧模式将帮助你获得“固若金汤”的成就
23 =设置“等待时间”来让机器人关闭以获取护盾
24 =资源设置值用于判断什么时候进攻
25 =必须在开启固若金汤模式前保存设定值
26 =点击下面的链接了解更多信息：
27 =更多信息

[619]

2 = PushBullet
3 =启用
4 =启用PushBullet通知
5 =远程控制
6 =启用PushBullet遥控功能
7 =开始时删除消息
8 =当您启动机器人时会删除所有以前的推送通知
9 =立即删除所有消息
10 =点击此处删除所有Pushbullet消息
11 =删除消息于
12 =删除所有比这个时间更久的消息
13 =设置删除信息的时间间隔
14 =访问令牌（token）
15 =您需要一个令牌使用PushBullet。从PushBullet.com获得令牌
16 =简况/村庄名字
17 =你的简况/村庄名字 - 这个的设定可以在综合标签下面找到.
18 =使用这些选项发送一个推送信息
19 =找到匹配
20 =发送找到的要攻击的村庄的可以获得的总共资源数.
21 =最后战役(照片)
22 =发送最后袭击的战利品截图.
23 =最后战役(文本)
24 =发送最后战役使用文本形式发送.
25 =兵营满营
26 =当兵营满营时，发送一个警告提示信息.
27 =城墙升级
28 =发送一个城墙升级信息
29 =错误:不同步/掉线
30 =报错时发送信息: Client and Server out of sync
31 =休息一下
32 =当你村庄在线时间太长了，发送一个信息提示你需要休息下.
33 =村庄信息
34 =发送村庄信息
35 =最新攻击警报
36 =发送关于最新的攻击警报信息
37 =另外的设备链接
38 =发送一个信息提示：另外一个设备正在链接.

[620]

0 =PushBullet 远程控制功能
1 = BOT
14 =HELP
2 = - 发送帮助信息
15 =DELETE
3 = - 删除你以前的全部推送信息
16 =RESTART
4 = - 重新启动 （村庄名字）的机器人和BS
17 = STOP
5 = - 停止<村庄名字>机器人 
18 =PAUSE
6 = - 暂停 <村庄名字>机器人
19 = RESUME
7 = - 恢复<村庄名字>机器人
20 = STATS
8 = - 发送村庄统计信息 <村庄名字>
21 = LOG
9 = - 发送当前<村庄名字>的日志文件
22 = LASTRAID
10 = - 发送<村庄名字>最后战役的收获截图
23 = LASTRAIDTXT
11 = - 发送<村庄名字>的最后战役的最后获得战利品 
24 = SCREENSHOT
12 = - 发送<村庄名字>屏幕截图 
35=G
36=E
37=D
38=T
42=No. of Free Builders
85=Your Army Camps are now Full
89=Match Found! after
75=skip(s)
34=Last Raid txt
67=Chief, we need some rest!
68=Village must take a break..
74=Disconnected after
76=Cannot locate Next button, Restarting Bot
70=Request to Pause
71=Your request has been received. Bot is now paused
86=Request to Pause
88=Your bot is currently paused, no action was taken
72=Request to Resume
73=Your request has been received. Bot is now resumed
65=Another Device has connected
66=Another Device has connected, waiting



[621]

26 =设定的％
27 =数量
28 =训练的
29 =法术
1 =圣水兵
2 =设定军组合物的类型。
3 =使用训练营 模式 或者 使用自己手动定制模式
4 =模式：弓箭手
5 =模式：野蛮人
6 =模式：哥布林
7 =模式：黄毛.弓箭
8 =模式：黄.弓.巨.哥
9 =模式：黄.弓.巨
10 =模式：黄.弓.哥
11 =模式：黄.弓.哥.巨.炸
12 =使用训练营模式
13 =自定义
14 =部队
15 =总计
16 =总百分比要等于100%
17 =兵营模式
18 =设置训练营的部队
19 =部队的强度（整个比例）
20 =全部兵力
21 =训练营军队达到总数的百分比为 , 就开始攻击.
22 =自定义的兵种 数量
23 =黑水兵
24 =增加黑水兵（个数）
25 =暗黑训练营兵种

[622]

1 =法术
2 =药水容量
3=输入药水的数量，如果不使用，请输入0


[623]
1 =加速设置
2 =加速训练营
3 =训练营
4 =多个训练营进行加速! 慎用！
5 =训练营
6 =使用此来提高你的兵营宝石！小心使用！
7 =加速法术工厂
8 =法术工厂
9 =用宝石加速法术工厂! 慎用!
10 =黑暗法术工厂
11 =用宝石加速黑水工厂! 慎用!
12 =加速英雄
13 =野蛮人之王
14 =用宝石加速蛮王! 慎用!
15 =弓箭手女王
16 =用宝石加速女王! 慎用!
17 =大守护者
18 =用宝石加速大守护者! 慎用!
19 =加速时段

[624]

1 =攻击
2 =攻击类型
3 =标准攻击
4 =脚本攻击
5 =挤压式攻击
6 =军队
7 =使用所有军队
8 =用训练营
9 =只是用野蛮人
10 =只是用弓箭手
11 =野蛮人+弓箭手
12 =野蛮人+哥布林
13 =弓箭手+哥布林
14 =野蛮人+弓箭手+巨人
15 =野蛮人+弓箭手+巨人+哥布林
16 =野蛮人+弓箭手+野猪骑士
17 =野蛮人+弓箭手+亡灵
18 =选择攻击所使用的部队
19 =使用英雄与援军
20 =攻击时使用你的蛮王...
21 =攻击时使用你的女王...
22 =攻击时使用你的大守护者...
23 =如果部落城堡有援兵，放下你的援兵
24 =攻击时使用你的雷电法术...
25 =使用你的治疗攻击法术的时候...
26 =攻击时使用你的狂暴法术...
27 =攻击时使用您的弹跳法术...
28 =攻击时使用你的冰冻法术...
29 =攻击时使用你的毒药法术...
30 =攻击时使用你的地震法术...
31 =攻击时使用你的急速法术...
32 = 偷本
33 = 偷外置大本
34 =如果是死鱼则启动死鱼的攻击方式
35 =距离
36 =大本营与边界的距离
37 =你可以增加或者编辑进攻 编辑 csv 设置文件 在 THSnipe 文件夹
38 =攻击外置大本
39 =搜索外置大本的鱼
40 =提示：请勾选“偷本”选项卡，如果你只想搜索与攻击暴露的大本营。
41=大本营在7级以上才可启用！
42=大本营在9级以上才可启用！
43=大本营在11级时启用！

[625]

0 =搜索设置
1 =搜索
2 =设置搜索的最小次数
3 =设置搜索的最大次数
4 =奖杯
5 =攻击的鱼的最小杯数
6 =攻击的鱼的最大杯数
7 =军营
8 =搜索前军队所达的最小比例%
9 =攻击前等待英雄复活
10 =攻击前等待蛮王复活...
12 =攻击前等待女王复活...
13 =攻击前等待大守护者复活...
14 =搜寻条件
15 =搜搜素条件的设定值.
16 = 和: 两者同时满足,金 和 水.
17 = 或者: 其中一个条件满足, 金 或者 水.
18 = 加: 金和水的总数达到
19 =金和水
20 =金或水
21 =金加水
22 =金 和 黑水
23 =设置当金币搜索满足最小值时开始攻击
24 =设置水达到搜索的最小值时开始攻击
25 =设置金加水的最小开始攻击数值.
26 =黑水
27 =搜到鱼的黑水最小值
28 =设置搜到鱼的黑水达到最小值时开始攻击
29 =搜索的鱼的杯达到设定值
30 =达到设定值的最小杯时开始攻击.
31 =大本
32 =搜索鱼的大本最大等级
33 =设定开始攻击的大本最大等级.
34 =大本外置
35 =搜到大本外置的鱼
36 =弱防御
37 =搜索的鱼的低等级防御
38 =设定迫击炮的最高等级
39 =设定法师塔的最高等级
40 =满足一个条件就攻击
41 =当满足设定条件中的一个就开始攻击.
42 =增加距离大本营边缘的方块
43 =
44 = - 训练时
45 =大本与边缘的距离
46 = - 部队满时
47 =输入多少 草坪' 1x1 大小 ，在大本前面的草坪数，会被认为是大本外置
48 =例如: (0) 大小; 大本必须全部一边全部在外. (4) 大小: 大本最近的中心或者距离边缘有4块大小。.
49 =如果大本距离设定的值的数目大则.跳过
50 =当连续升级英雄时等待英雄选项禁用！
51=需要大本营7级或更高
52=需要大本营9级或更高
53=需要大本营11级
54=注意 - 搜索范围仅在进攻选项中有效
55=这个设置不能使用重新搜索选项
56=这个选项不能使奖杯保持在你设定的范围内



[626]

15 =该复选框被勾选时，Bot进行死鱼判别时将对
30 =为满(死鱼)
1 =选择收集器
2 =选择和设置搜索死鱼时进行判别死鱼的采集器级别和死鱼判定标准
16 =6 级圣水采集器进行扫描判断
3 =6级采集器 >
23 =选设置判定 6 级采集器中存储圣水为满（死鱼标准）的百分比
10 =（N / A）
17 =7级圣水采集器进行扫描判断
4 =7级采集器 >
24 =设置判定 7 级采集器中存储圣水为满（死鱼标准）的百分比
18 =8 级圣水采集器进行扫描判断
5 =8级采集器 >
25 =设置判定 8 级采集器中存储圣水为满（死鱼标准）的百分比
19 =9 级圣水采集器进行扫描判断
6 =9级采集器 >
26 =设置判定 9 级采集器中存储圣水为满（死鱼标准）的百分比
20 =10 级圣水采集器进行扫描判断
7 =10级采集器>
27 =设置判定 10 级采集器中存储圣水为满（死鱼标准）的百分比
21 =11 级圣水采集器进行扫描判断
8 =11级采集器>
28 =设置判定 11 级采集器中存储圣水为满（死鱼标准）的百分比
22 =12 级圣水采集器进行扫描判断.
9 =12级采集器>
29 =设置判定 12 级采集器中存储圣水为满（死鱼标准）的百分比
11 =误差设置
12 =使用此滑动器进行（采集器）图片误差调整.
13 =如果你想对个别的图片进行误差修正调整，你必须编辑该图片.
31 =警告：若不确定如何设置，请保持该设置为“0”！除非你知道该如何进行误差调整，否则不要改变该设置。


[627]

1 =加载预配置的文件
2 =加载配置
3 =删除配置
4 =打开配置文件夹

[628]

1 =配置文件名
2 =注
3 =
4 =保存配置

[629]

1 =弱本攻击组合
2 =在弱本模式，满足以下条件时将会进攻
3 =启用后混混
4 =弱本模式开启前的已搜索次数
6 =大本营水平
7 =大本营低于这个等级时进攻
8 =发现时代的攻击设置
9 = 死鱼
10 =用死鱼模式攻击
11 =活鱼
12 =用活鱼攻击


[630]

1 =搜索设定
2 =启用降低搜索条件
3 =当搜索达到一定次数后，自动降低搜索条件s.
4 =降低目标, 每
5 =输入次数，达到设置数后，之前的条件重置重新搜索.
6 =降低金币 -
7 =每一次降低的金币的数值
8 =降低圣水 -
9 =每一次降低的圣水的数值
10 =降低金币+圣水和 -
11 =每一次降低的圣水和金币的和的数值
12 =降低黑水 -
13 =每一次降低的黑水的数值
14 =降低奖杯 -
15 =每一次降低的奖杯的数值
16 =增强攻击设置
17 =立即进攻！设置
18 =勾选这个设置，如果你想使用立即进攻!' 下面的按钮
25 =开始和暂停按钮来绕过死鱼或者全部大本搜索值
26 立即攻击，这个按钮就出现在只有搜索到满足条件的村庄时
19 =加
20 =增加一定的反应时间去减少搜索的次数
21 =重启搜索
22 =搜索X次后，回到基地并重新开始搜索
23 =当发现鱼时通知我
24 =当发现可以攻击的基地，系统会出现一个弹出提示
26=立即进攻！按钮仅会在搜索进攻时显示！

[631]
79=不检查
80=选择挤压攻击方式
59=慢:检查每一个收集器的资源
60=快:仅检查每一个收集器的等级
2=攻击的圣水收集器的最小等级
3=等级 1-4
4=等级 5
5=等级 6
6=等级 7
7=等级 8
8=等级 9
9=等级 10
10=等级 11
11=等级 12
31=图例
32=0-4%
33=5-19%
34=20-74%
35=75-89%
36=90-100%
56=攻击的建筑物
13=攻击
14=如果等级
16=只在这种情况攻击
17=红线和收集器的距离
18=攻击金矿当金币少于
19=攻击升水收集器当圣水少于
20=攻击黑钻当黑水少于
21=4. 攻击每一个建筑物所使用的军队数
22=- 每波军队数:
23=- 最大波数:
85=选择攻击一个收集器可以放置的最大波数
86=如果收集器被破坏将不再放置军队
24=-每波之间的延迟(ms):
71=5.放兵设置
72=在同一位置放哥布林
73=在不同位置放哥布林
74=攻击指令: as found
75=攻击指令: Random
76=攻击指令: by side
61=检查被破坏的建筑
62=在放一波兵前释放
63=在攻击一个建筑物前,检查它是否已经被另外一波部队破坏
64=你必须有一个高的延迟设置在两波军队之间以启动此选项
65=释放一波兵后检查建筑物摧毁情况
66=攻击一个建筑物后,检查它是否已经被另外一波部队破坏
67=你必须有一个高的延迟设置在两波军队之间以启动此选项
25=5a.挤压式攻击后狙击外置大本营
82=启用狙击大本营
27=到边界的最大格数
28=使用算法
29=攻击大本营,即使没有攻击到收集器
84=5b. 用一个脚本继续攻击
83=启用脚本攻击
30=使用脚本攻击死鱼,这将会禁用标准攻击
68=误差设置
50=误差范围
51=普通建筑物误差
52=加速的建筑物误差
53=被摧毁的建筑物误差
37=Debug
38=Make Images of each extractor with offset
41=Make Images of villages
39=全屏,仅用于debug
81=启用这个选项,你可以检查未被攻击的收集器的图像


[632]

31 =重置统计
2 =起始值
0 =STATS
3 =报表
4 =将显示
5 =看这里
6 =第一次运行
7 =当你开始运行时金币的数值
8 =当你开始运行时圣水的数值
9 =当你开始运行时黑水的数值
10 =当你开始运行时奖杯的数值
20 =总收益
99 =将更新
97 =这以后
98 =每次攻击
21 =在机器人运行期间的金币总收益数
22 =(这个包含手动升级建筑物花费的资源)
23 =在机器人运行期间的圣水总收益数
24 =在机器人运行期间的黑水总收益数
25 =在机器人运行期间的奖杯总收益数
26 =每小时收益
27 =金币收益/每小时
28 =圣水收益/每小时
29 =黑水收益/每小时
30 =奖杯收益/每小时
102=最后一次进攻
11 =收益
12 =你最后一次进攻中获得的金币
13 =你最后一次进攻中获得的圣水
14 =你最后一次进攻中获得的暗水
15 =你最后一次进攻中获得或失去奖杯的数量
16 =联赛奖励
17 =最近一次进攻，战争奖励的金币
18 =最近一次进攻，战争奖励的圣水
19 =最近一次进攻，战争奖励的黑水
32 =统计:综合
105 =运行
47 =运行时间
48 =机器人的总运行时间。
57 =丢失连接数
58 =丢失连接数
33 =总攻击次数
34 =机器人进攻次数
35 =跳过
36 =机器人搜寻时跳过的次数
45 =总降杯数
46 =在综合设置标签设置的奖杯范围内，降低的奖杯数.
103=升级统计
37 =用金币升级
38 =使用金币升级城墙的数目
39 =用圣水升级
40 =使用圣水升级城墙的数量
41 =使用金币升级建筑的数量
42 =使用圣水升级建筑的数量
43 =升级英雄
44 =英雄升级数量
104 =升级成本统计
49 =金币使用成本
50 =升级城墙用金币
51 =升级用圣水
52 =圣水升级城墙用圣水
53 =金币升级建筑用金币
54 =圣水升级建筑用圣水
55 =升级用黑水：
56 =升级英雄用黑水
59 =搜索成本
60 =跳过村庄所花费的金币
61 =训练军队成本
62 =训练军队所花费的圣水
63 =黑水训练成本
64 =使用黑水兵时所花费的黑水
65 =收集的金币
66 =自己金矿收集的金币
67 =圣水收集
68 =自己采集器采集到的圣水
69 =黑水采集
70 =暗黑矿井收集到的黑水
71 =死鱼
72 =攻击
73 =攻击死鱼的次数.
74 =收益
75 =死鱼攻击获得的金币量.
100 =死鱼攻击中获得到的黑水量
76 =死鱼攻击获得的圣水量.
78 =活鱼
79 =活鱼攻击次数
80 =活鱼攻击获得的金币量
81 =活鱼攻击获得的圣水量
82 =活鱼攻击获得的黑水量
83 =活鱼攻击获得的奖杯量
90 =偷本
101 = 偷本由机器人袭击纪录。
91 =偷本过程中获得到的金币量
92 =偷本过程中获得到的圣水量
93 =偷本过程中获得到的黑水值
94 =偷本过程中获得到的奖杯量
95 =偷本成功个数
96 =偷本失败个数
84 =攻击弱本统计
85 =在攻击中，弱防本的数量
86 =弱防本攻击中获得到的金币量
87 =弱防本攻击中获得到的圣水量
88 =弱防本攻击中获得到的黑水量
89 =弱防本攻击中获得到的奖杯量

[633]

1 =分享视频
2 =分享视频在你的部落内
3 =勾选这个将会在你的部落内分享视频
4 =当战役战利品
5 =只有当战役战力品中金币达到这个数值时才分享视频
6 =只有当战利品中圣水达到这个数值时才分享视频
7 =只有当战利品中黑水达到这个数值时才分享视频
8 =为这个清单使用一个随机信息
9 =太棒了\r\n很好\r\n感谢支援\r\n哇哦~
10 =分享录像是发送信息
11 =包含战利品信息在截图文件内
12 =检查这一点，如果你想保存已被袭击村庄的战利品快照
13 =在文件内包含战利品信息
14 =包含的截图文件名战利品信息

[634]
1 =英雄技能
2 =自动使用技能(红血时）
3 =当在上面勾选攻击时使用英雄选项时，
4 =攻击中当英雄变虚弱时会分别自动开启技能
5 =定时开启技能
6 =设定X秒后定时开启英雄技能
7 =所有英雄会在设定时间同时开启技能
8 =设置开启英雄技能的时间为攻击开始后X秒
9 =设定X秒后定时开启大守护者技能
10 =设定X秒定时开启大守护者的技能.
11 =设置开启英雄技能的时间为攻击开始后X秒
12 =援兵捐收平衡
13 =平衡 捐/收
14 =如果你的捐收比大于下面的设定值则在攻击时使用援兵
15 =捐兵比率
16 =捐 / 收
17 =1/1 捐收平衡, 1/2 捐兵数=收兵数的一半
18 =收兵比率


[635]

1 =创建新的攻击脚本文件
2 =新的脚本文件名
3 =文件已存在，请输入新的文件名
4 =创建文件时出错
5 =复制到新的脚本文件
6 =复制
7 =到新的脚本文件名


[636]

0 =GUI TAB EXPERT
2 =当机器人载入时
3 =检查升级
4 =勾选将检查你的机器人是不是最新版本.
5 =删除日志文件
6 =删除比指定日期更长的日志文件
7 =日
8 =删除缓存文件
9 =删除比指定日期更长的缓存文件
10 =删除战利品截图
11 =删除比指定日期更长的战利品截图图片
12 =当机器人开始时
13 =自动开始后
58 =秒
15 =检查游戏语言（EN）
16 =检查游戏语言是不是设定正确 (必须设定为 English).
17 =自动对齐
18 =复位/调整  BS和机器人窗口 屏幕 
19 =抵消设置
20 =抵消在BS和机器人窗口之间的水平像素
21 =抵消在BS和机器人窗口之间的垂直像素
22 =0,0: BS-Bot
23 =0,0: Bot-BS
24 =对齐: Bot 右对齐 BS
25 =对齐: Bot 左对齐 BS
26 =对齐: Bot 右下角对齐 BS
27 =对齐: Bot 左下角对齐 BS
28 =0,0: 复位 BS 屏幕 重新定位 0,0 在系统桌面 机器人窗口左或者右对齐它.
29 =对齐: 只是重排窗口, 对齐机器人窗口和BS窗口 右上对齐t,左上对齐, 右下对齐 或 左下对齐t.
30 =T定时
31 =训练军队
32 =延迟
33 =如果你的电脑反应慢，增加延迟
45 =其它选项
55 =屏幕截图照片选项
56 =保存为PNG格式
57 =隐藏村庄和部落的名字
61 =PB时只重启COC一次
62 =用来设置强制下线（PB）时只重启COC一次的时间间隔
63 =设置保持CoC退出状态的时间，设为15分钟以重置强制下线时间计时器!
64 =分
65 =将被强制下线时提前退出CoC
66 =设置即将被强制下线时提前退出CoC的时间，注意：设置的数值小于10分钟时可能不能实现此功能!
46=军营总兵力
47=如果没有检测到兵营总兵力，用询问来替代
34 =调试
40 =坐标
35 =调试: 点击(x,y)坐标写入日志.
41 =消息
36 =调试: 激活调试SetLog消息代码故障排除
42 = OCR
37 =调试: 激活保存OCR图像进行故障排除
43 =图片
38 =调试: 激活保存图片进行故障排除
44 =建筑
39 =调试: 激活在日志中显示建筑物位置坐标信息

71=:重新启动bot以载入新的语言

73 =训练
74 =调试：启用显示在训练中的调试。
75 =村庄搜寻延迟
76 =使用此滑块改变的时候了一个村庄的攻击搜索时点击下一步之间等待。
77 =这个可能弥补一些电脑出现失去链接的错误（减少出现失去连接错误）！
78 =无法保证! 当然这不会总是有相同的结果！
79 =最小
80 =最大
81 =用这个设置激活 村庄随机搜索延迟
82 =最大的滑条设置要高于上面最小的滑块的设定值
83 = GUI语言
84 =使用此切换到不同的GUI语言
85 =远程配置设置
86 =当 '其他设备链接时'等待
87 =输入等待时间 (按秒计算) 当其他设备链接后，机器人再次连接的等待时间。
88 =测试训练
89 =测试捐赠
90 =测试进攻
91=在线测试捐赠
92=调试：使用OCR捐兵，仅模拟捐兵实际不会捐赠任何队伍
[637]

1 =切换配置文件
2 =使用此切换到不同的配置文件
3 =你的配置文件必须存在！
4 =我的村庄
5 =你的村庄/配置文件的名字
6 =添加新的配置文件
7 =确认
8 =删除文件
9 =取消
10 =重命名文件

[640]
43=点击确认，然后点击你的实验室
26=点击建筑物后不要过快地移动你的鼠标
27=确认你的建筑物名称可见！
1=确认|取消
44=定位实验室...
49=点击确认，然后点击你的大本营
50=定位大本营...
63=点击确认删除和重新设置建筑物信息
64=注意=>> 机器人将会退出并且需要重启以完成设置
65=或者点击取消以离开
66=删除并退出|取消
67=确认删除建筑物信息?
68=你真的确定删除建筑物信息?
69=点击确认以删除和重设建筑物信息(手动)
32=点击确认，然后点击你的部落城堡
33=定位部落城堡...
